<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML><HEAD><TITLE>
Fichier Lisez-moi d'Adobe Flash Player</TITLE><META http-equiv=Content-Type content="text/html; charset=windows-1252">
<STYLE type=text/css>
BODY {
	FONT-SIZE: 12px; FONT-FAMILY: Geneva, Arial, Helvetcia, sans-serif
}
TD {
	FONT-SIZE: 12px; FONT-FAMILY: Geneva, Arial, Helvetcia, sans-serif
}
.style1 {color: #FF0000}
.style2 {font-size: 10}
</STYLE>

<META content="MSHTML 6.00.2800.1400" name=GENERATOR>
</HEAD>
<BODY bgColor=#ffffff>
<TABLE width="61%" border=0>
  <TBODY>
  <TR>
    <TD>
      <DIV align=center>
      <P align="left"><FONT face="Arial, Helvetica, sans-serif" size=5><B>Utilisation des versions de d&eacute;boguage et de distribution d'Adobe Flash Player</B></FONT></P>
      </DIV></TD></TR></TBODY></TABLE><FONT 
face="Arial, Helvetica, sans-serif"><BR><BR><FONT size=2><BR></FONT></FONT>
<TABLE cellSpacing=2 cellPadding=4 width=600 border=0>
  <TBODY>
  <TR>
    <TD width=569 height=124>
      <P>Adobe&reg;  Flash&reg; CS3 Professional est dot&eacute; d'un d&eacute;bogueur int&eacute;gr&eacute;. Pour b&eacute;n&eacute;ficier de cette fonction, vous devez utiliser des versions sp&eacute;ciales d'Adobe&reg; Flash&reg; Player (versions de d&eacute;boguage). Les versions de d&eacute;boguage de Flash Player sont identiques aux versions de distribution, si ce n&rsquo;est qu'elles comportent du code suppl&eacute;mentaire leur permettant de communiquer avec Flash CS3 Professional.<br> <br>Pour simplifier les op&eacute;rations de d&eacute;veloppement et de d&eacute;boguage, le programme d'installation de Flash CS3 Professional installe par d&eacute;faut les versions de d&eacute;boguage du contr&ocirc;le ActiveX ou du plug-in dans le r&eacute;pertoire du navigateur. Notez toutefois que les versions de Flash Player disponibles en t&eacute;l&eacute;chargement sur le <A        href="http://www.adobe.com/fr">site Web d'Adobe</A> sont les versions de distribution&nbsp;: les versions de d&eacute;boguage sont uniquement disponibles avec Flash CS3 Professional. <br> <br>C&rsquo;est pourquoi Flash CS3 Professional comprend des programmes d'installation et des lecteurs, tous sign&eacute;s num&eacute;riquement, pour le plug-in, le contr&ocirc;le ActiveX et le lecteur autonome (projecteur). La signature num&eacute;rique certifie que les fichiers sont authentiques et n'ont pas subi de modifications illicites. </P>
      <P><br>
      </P></TD></TR>
  <TR>
    <TD width=569>
      <P><B><A 
      href="#included">Fichiers inclus</A></B></P></TD></TR>
  <TR>
    <TD width=569>
      <P><B><A 
      href="#debug">Utilisation de la fonction de d&eacute;boguage</A></B></P></TD></TR>
  <TR>
    <TD width=569>
      <P><A 
      href="#install"><B>Installation d'Adobe Flash Player 9 </B></A></P></TD></TR>
  <TR>
    <TD width=569>
      <P><A 
      href="http://www.adobe.com/go/flashplayer_uninstall_fr"><B>D&eacute;sinstallation d'Adobe Flash Player</B></A></P></TD></TR></TBODY></TABLE><BR><BR><BR>
<TABLE cellSpacing=2 cellPadding=2 width=600 border=0>
  <TBODY>
  <TR>
    <TD class=tablehead bgColor=#000099><FONT 
      face="Arial, Helvetica, sans-serif"><A name=included></A><B><FONT 
      color=#ffffff size=3>Fichiers inclus</FONT></B></FONT></TD></TR></TBODY></TABLE>
<TABLE cellSpacing=2 cellPadding=4 width=624 border=0>
  <TBODY>
  <TR>
    <TD colSpan=3><p> Apr&egrave;s l'installation, les r&eacute;pertoires Players sous Windows (Adobe/Adobe Flash CS3/Players) et sur Mac (Adobe Flash CS3/Players) ont la structure suivante.</p>
      <p> <span class="menuItem2"> Ces r&eacute;pertoires contiennent les fichiers qui seront utilis&eacute;s par Flash pour cr&eacute;er des projecteurs ou afficher du contenu autonome. Les versions d'Adobe Flash Player plac&eacute;es dans ce dossier par le programme d&rsquo;installation de Flash CS3 Professional sont les versions de d&eacute;boguage. </span>         </p>
      </TD>
  </TR>
  <TR>
    <TD width="6">&nbsp;</TD>
    <TD colSpan=2><span class="menuItem2"><strong>Adobe Flash Player - Lisez-moi.htm </strong>- Ce fichier.</span></TD>
  </TR>
  <TR>
    <TD>&nbsp;</TD>
    <TD colSpan=2> <strong>FlashPlayer.exe, Flash Player.app</strong>- Ce lecteur autonome sera utilis&eacute; pour afficher du contenu localement, par exemple si l&rsquo;utilisateur double-clique sur un fichier SWF. </TD>
  </TR>
  <TR>
    <TD>&nbsp;</TD>
    <TD colSpan=2><span class="menuItem2"> <strong>Debug/ </strong>- Ce r&eacute;pertoire contient les copies de sauvegarde des versions de d&eacute;boguage d'Adobe Flash Player. </span></TD>
  </TR>
  <TR>
    <TD><P>&nbsp;</P></TD>
    <TD width="4"><P>&nbsp;</P></TD>
    <TD width="582"><P><B>Install Flash Player 9 ActiveX.msi - </B>Programme d&rsquo;installation de la version de d&eacute;boguage du contr&ocirc;le ActiveX d'Adobe Flash Player, utilis&eacute; par Internet Explorer sous Windows. </P></TD>
  </TR>
  <TR>
    <TD><P>&nbsp;</P></TD>
    <TD><P>&nbsp;</P></TD>
    <TD><P><B>Install Flash Player 9 Plugin.msi  - </B>Programme d&rsquo;installation de la version de d&eacute;boguage du plug-in d'Adobe Flash Player, utilis&eacute; par les navigateurs qui appellent le plug-in. </P></TD>
  </TR>
  <TR>
    <TD><P>&nbsp;</P></TD>
    <TD><P>&nbsp;</P></TD>
    <TD><P><B>Install Flash Player 9 UB.dmg - </B>Programme d&rsquo;installation de la version de d&eacute;boguage d'Adobe Flash Player sous Macintosh. </P></TD>
  </TR>
  <TR>
    <TD><P>&nbsp;</P></TD>
    <TD><P>&nbsp;</P></TD>
    <TD><P> <strong>FlashPlayer.exe (Windows)</strong>, <strong>FlashPlayer.app (Macintosh) </strong> - Ce fichier est la version de d&eacute;boguage du lecteur autonome, qui permet de visionner du contenu Flash localement. </P></TD>
  </TR>
  <TR>
    <TD>&nbsp;</TD>
    <TD colSpan=2> <strong>Release/ </strong> - Ce r&eacute;pertoire contient les copies de sauvegarde des versions de distribution d'Adobe Flash Player. </TD>
  </TR>
  <TR>
    <TD><P>&nbsp;</P></TD>
    <TD><P>&nbsp;</P></TD>
    <TD><P> <strong>Install Flash Player 9 ActiveX.msi - </strong>Programme d&rsquo;installation de la version de distribution du contr&ocirc;le ActiveX d'Adobe Flash Player, utilis&eacute; par Internet Explorer sous Windows. </P></TD>
  </TR>
  <TR>
    <TD><P>&nbsp;</P></TD>
    <TD><P>&nbsp;</P></TD>
    <TD><P> <strong>Install Flash Player 9 Plugin.msi  - </strong>Programme d&rsquo;installation de la version de distribution du plug-in d'Adobe Flash Player, utilis&eacute; par les navigateurs qui appellent le plug-in. </P></TD>
  </TR>
  <TR>
    <TD><P>&nbsp;</P></TD>
    <TD><P>&nbsp;</P></TD>
    <TD><P> <strong>Install Flash Player 9 UB.dmg - </strong><strong></strong>Programme d&rsquo;installation de la version de distribution d'Adobe Flash Player sous Macintosh. </P></TD>
  </TR>
  <TR>
    <TD><P>&nbsp;</P></TD>
    <TD><P>&nbsp;</P></TD>
    <TD><P> <strong>FlashPlayer.exe (Windows)</strong>, <strong>FlashPlayer.app (Macintosh) </strong> - Ce fichier est la version de distribution du lecteur autonome, qui permet de visionner du contenu Flash localement. </P></TD>
  </TR>
  </TBODY></TABLE>
<BR><BR><BR>
<TABLE cellSpacing=2 cellPadding=2 width=600 border=0>
  <TBODY>
  <TR>
    <TD class=tablehead bgColor=#000099><A name=debug></A><FONT 
      face="Arial, Helvetica, sans-serif" color=#ffffff size=3><B>Passage de la version de d&eacute;boguage &agrave; la version de distribution (et vice-versa) du lecteur</B></FONT></TD>
  </TR></TBODY></TABLE>
<TABLE cellSpacing=2 cellPadding=4 width=600 border=0>
  <TBODY>
  <TR>
    <TD colSpan=3>
      <P>Pour passer de la version de d&eacute;boguage &agrave; la version de distribution (et vice-versa) du lecteur, il est n&eacute;cessaire de placer les fichiers du lecteur autonome appropri&eacute;s dans le r&eacute;pertoire Players. Vous pouvez remplacer les fichiers du lecteur Flash Player autonome du dossier parent aussi souvent que n&eacute;cessaire. Consid&eacute;rez les dossiers &laquo;&nbsp;Debug&nbsp;&raquo; et &laquo;&nbsp;Release&nbsp;&raquo; comme des dossiers source et utilisez leur dossier parent comme dossier de travail de votre lecteur Flash Player autonome.</P>
      </TD></TR>
  <TR>
    <TD width=7>
      <P>&nbsp;</P></TD>
    <TD width=571 colSpan=2>
      <P>&nbsp;</P></TD></TR>
  <TBODY>
  <TR>
    <TD width=7>
      <P>&nbsp;</P></TD>
    <TD width=571 colSpan=2>
      <P><B>Pour utiliser la version de d&eacute;boguage du lecteur autonome ou cr&eacute;er des projecteurs avec d&eacute;boguage &agrave; l&rsquo;aide de Flash CS3 Professional</B></P></TD></TR>
  <TR>
    <TD width=7>
      <P>&nbsp;</P></TD>
    <TD width=571 colSpan=2>
      <P>Copiez les fichiers du dossier &laquo;&nbsp;Debug&nbsp;&raquo; dans le dossier &laquo;&nbsp;Players&nbsp;&raquo;. Veillez &agrave; bien les <em>copier</em> et non pas &agrave; les <em>d&eacute;placer </em> afin d&rsquo;&eacute;viter de supprimer par inadvertance vos copies d&rsquo;archive. <br>
      </P></TD></TR>
  <TR>
    <TD>&nbsp;</TD>
    <TD colSpan=2>&nbsp;</TD>
  </TR>
  <TR>
    <TD><P>&nbsp;</P></TD>
    <TD colSpan=2><P><B>Pour utiliser la version de d&eacute;boguage du lecteur dans votre navigateur </B></P></TD>
  </TR>
  <TR>
    <TD><P>&nbsp;</P></TD>
    <TD colSpan=2><P>      Pour utiliser les versions de d&eacute;boguage du contr&ocirc;le ActiveX ou du plug-in, supprimez la version actuelle du contr&ocirc;le ActiveX ou du plug-in et ex&eacute;cutez le programme d'installation du contr&ocirc;le ActiveX ou du module externe appropri&eacute; &agrave; partir du dossier &laquo;&nbsp;Debug&nbsp;&raquo;. *</P></TD>
  </TR>
  <TR>
    <TD colSpan=3 height=2>&nbsp;</TD></TR>
  <TR>
    <TD width=7>
      <P>&nbsp;</P></TD>
    <TD width=571 colSpan=2>
      <P><B>Pour utiliser la version de distribution du lecteur autonome ou cr&eacute;er des projecteurs en version de distribution &agrave; l&rsquo;aide de Flash CS3 Professional</B></P></TD></TR>
  <TR>
    <TD width=7>
      <P>&nbsp;</P></TD>
    <TD width=571 colSpan=2>
      <P>Copiez les fichiers du lecteur autonome Flash Player du dossier &laquo;&nbsp;Release&nbsp;&raquo; dans le dossier &laquo;&nbsp;Players&nbsp;&raquo;.  Veillez &agrave; bien les <em>copier</em> et non pas &agrave; les <em>d&eacute;placer </em> afin d&rsquo;&eacute;viter de supprimer par inadvertance vos copies d&rsquo;archive. </P>
      </TD></TR>
  <TR>
    <TD>&nbsp;</TD>
    <TD colSpan=2>&nbsp;</TD>
  </TR>
  <TR>
    <TD width=7>
      <P>&nbsp;</P></TD>
    <TD width=571 colSpan=2>
      <P><B>Pour utiliser la version de distribution du lecteur dans votre navigateur </B></P></TD></TR>
  <TR>
    <TD>&nbsp;</TD>
    <TD colSpan=2>Pour utiliser les versions de distribution du contr&ocirc;le ActiveX ou du plug-in, supprimez la version actuelle du contr&ocirc;le ActiveX ou du plug-in et ex&eacute;cutez le programme d'installation du contr&ocirc;le ActiveX ou du module externe appropri&eacute; &agrave; partir du dossier &laquo;&nbsp;Release&nbsp;&raquo;. *</TD>
  </TR>
  <TR>
    <TD colSpan=3>
      <P>&nbsp;</P></TD></TR>
  <TR>
    <TD colSpan=3>
      <P><I><B>* Remarque</B></I> : Si vous ex&eacute;cutez le programme d'installation d'une nouvelle version de Flash Player sans supprimer d'abord le module externe ou le contr&ocirc;le ActiveX install&eacute;, le processus d'installation ne sera pas lanc&eacute; car les versions de d&eacute;boguage et de distribution du lecteur Flash Player ont le m&ecirc;me num&eacute;ro de version. Vous devez effacer physiquement le plug-in ou le contr&ocirc;le ActiveX avant de lancer le programme d'installation. Reportez-vous &agrave; la section <A        href="http://www.adobe.com/go/flashplayer_uninstall_fr">D&eacute;sinstallation d'Adobe Flash Player</A> pour toutes instructions. 
</P></TD></TR></TBODY></TABLE>
<BR><BR><BR>
<TABLE cellSpacing=2 cellPadding=2 width=600 border=0>
  <TBODY>
  <TR>
    <TD class=tablehead bgColor=#000099><FONT 
      face="Arial, Helvetica, sans-serif"><A name=install></A><B><FONT 
      color=#ffffff size=3>Installation d'Adobe Flash Player 9</FONT></B></FONT></TD>
  </TR></TBODY></TABLE>
<TABLE cellSpacing=2 cellPadding=4 width=600 border=0>
  <TBODY>
  <TR>
    <TD colSpan=4>
      <P><B>Pour installer Adobe Flash Player 9 pour Internet Explorer ou AOL (contr&ocirc;le ActiveX) sous Windows :</B></P></TD></TR>
  <TBODY>
  <TR>
    <TD width=5>
      <P>&nbsp;</P></TD>
    <TD vAlign=top width=15>
      <P>1.</P></TD>
    <TD width=548 colSpan=2>
      <P>Fermez le navigateur avant d'installer le nouveau contr&ocirc;le ActiveX.</P></TD></TR>
  <TR>
    <TD width=5>
      <P><s><span class="style1"></span></s></P></TD>
    <TD vAlign=top width=15>
      <P class="style1"><font color="#000000">2.</font></P></TD>
    <TD width=548 colSpan=2>
      <P class="style1"><font color="#000000">Supprimez les versions ant&eacute;rieures du contr&ocirc;le ActiveX. Reportez-vous &agrave; la section <A        href="http://www.adobe.com/go/flashplayer_uninstall_fr">D&eacute;sinstallation d'Adobe Flash Player</A> pour obtenir des informations  d&eacute;taill&eacute;es concernant la suppression des versions actuelles et ant&eacute;rieures du contr&ocirc;le ActiveX de Flash Player.</font></P></TD></TR>
  <TR>
    <TD width=5>
      <P>&nbsp;</P></TD>
    <TD vAlign=top width=15>
      <P>3.</P></TD>
    <TD width=548 colSpan=2>
      <P>Double-cliquez sur le fichier &laquo;&nbsp;Install Flash Player 9 ActiveX.msi&nbsp;&raquo; pour lancer l'installation.</P></TD></TR>
  <TR>
    <TD width=5>
      <P>&nbsp;</P></TD>
    <TD vAlign=top width=15>
      <P>4.</P></TD>
    <TD width=548 colSpan=2>
      <P>Ouvrez le navigateur. Flash Player 9 doit &ecirc;tre install&eacute; et fonctionner.</P></TD></TR>
  <TR>
    <TD colSpan=4>
      <P><BR></P></TD></TR>
  <TR>
    <TD colSpan=4>
      <P><B>Pour installer Adobe Flash Player 9 pour Firefox, Mozilla, Netscape, CompuServe ou Opera sous Windows&nbsp;:</B></P></TD></TR>
  <TR>
    <TD width=5>
      <P>&nbsp;</P></TD>
    <TD vAlign=top width=15>
      <P>1.</P></TD>
    <TD width=548 colSpan=2>Fermez le navigateur avant d'installer le nouveau module externe.</TD></TR>
  <TR>
    <TD width=5>
      <P>&nbsp;</P></TD>
    <TD vAlign=top width=15>
      <P class="style1"><font color="#000000">2.</font></P></TD>
    <TD width=548 colSpan=2><span class="style1"><font color="#000000">Supprimez les versions ant&eacute;rieures de Flash Player. Reportez-vous &agrave; la section <A        href="http://www.adobe.com/go/flashplayer_uninstall_fr">D&eacute;sinstallation </A></font></span><font color="#000000"><A        href="http://www.adobe.com/go/flashplayer_uninstall_fr">d'Adobe</A></font><span class="style1"><font color="#000000"><A        href="http://www.adobe.com/go/flashplayer_uninstall_fr"> Flash Player</A> pour obtenir des informations  d&eacute;taill&eacute;es sur la suppression des versions actuelles et ant&eacute;rieures du plug-in de Flash Player.</font></span></TD>
  </TR>
  <TR>
    <TD width=5>
      <P>&nbsp;</P></TD>
    <TD vAlign=top width=15>
      <P>3.</P></TD>
    <TD width=548 colSpan=2>Double-cliquez sur le fichier &laquo;&nbsp;Install Flash Player 9 Plugin.msi&nbsp;&raquo; pour lancer l'installation.</TD>
  </TR>
  <TR>
    <TD width=5>
      <P>&nbsp;</P></TD>
    <TD vAlign=top width=15>
      <P>4.</P></TD>
    <TD width=548 colSpan=2>Ouvrez le navigateur. Flash Player 9 doit &ecirc;tre install&eacute; et fonctionner. Pour v&eacute;rifier le bon fonctionnement du module dans Netscape, choisissez Aide &gt; A propos des modules externes dans le navigateur.</TD>
  </TR>
  <TR>
    <TD colSpan=4>
      <P><BR></P></TD></TR>
  <TR>
    <TD colSpan=4>
      <P><B>Pour installer Adobe Flash Player 9 pour Safari, Firefox, Mozilla, Netscape ou Opera sous Macintosh&nbsp;:</B></P></TD></TR>
  <TR>
    <TD width=5>
      <P>&nbsp;</P></TD>
    <TD vAlign=top width=15>
      <P>1.</P></TD>
    <TD width=548 colSpan=2>Fermez le navigateur avant d'installer le nouveau module externe.</TD></TR>
  <TR>
    <TD width=5>
      <P><s></s></P></TD>
    <TD vAlign=top width=15>
      <P class="style1"><font color="#000000">2.</font></P></TD>
    <TD width=548 colSpan=2><span class="style1"><font color="#000000">Supprimez les versions ant&eacute;rieures de Flash Player. Reportez-vous &agrave; la section <A        href="http://www.adobe.com/go/flashplayer_uninstall_fr">D&eacute;sinstallation </A></font></span><font color="#000000"><A        href="http://www.adobe.com/go/flashplayer_uninstall_fr">d'Adobe</A></font><span class="style1"><font color="#000000"><A        href="http://www.adobe.com/go/flashplayer_uninstall_fr"> Flash Player</A> pour obtenir des informations  d&eacute;taill&eacute;es sur la suppression des versions actuelles et ant&eacute;rieures du plug-in de Flash Player.</font></span></TD>
  </TR>
  <TR>
    <TD width=5>
      <P>&nbsp;</P></TD>
    <TD vAlign=top width=15>
      <P>3.</P></TD>
    <TD width=548 colSpan=2>Double-cliquez sur le fichier &laquo;&nbsp;Install Flash Player 9 UB&nbsp;&raquo; pour lancer l'installation. </TD>
  </TR>
  <TR>
    <TD width=5>
      <P>&nbsp;</P></TD>
    <TD vAlign=top width=15>
      <P>4.</P></TD>
    <TD width=548 colSpan=2>Ouvrez le navigateur. Flash Player 9 doit &ecirc;tre install&eacute; et fonctionner. Pour v&eacute;rifier le bon fonctionnement du module dans Netscape, choisissez Aide &gt; A propos des modules externes dans le navigateur.</TD>
  </TR></TBODY></TABLE>
<BR><BR><BR>
<TABLE cellSpacing=2 cellPadding=2 width=600 border=0>
  <TBODY>
  <TR>
    <TD class=tablehead bgColor=#000099><FONT 
      face="Arial, Helvetica, sans-serif"><A name=remove></A><B><FONT 
      color=#ffffff size=3>D&eacute;sinstallation d'Adobe Flash Player</FONT></B></FONT></TD>
  </TR></TBODY></TABLE>
<TABLE cellSpacing=2 cellPadding=4 width=600 border=0>
  <TBODY>
  <TR>
    <TD colSpan=3>
      <P>Les instructions de suppression du module externe et/ou du contr&ocirc;le ActiveX sont publi&eacute;es sur le site Web du support de Flash Player&nbsp;: <A        href="http://www.adobe.com/go/flashplayer_uninstall_fr">http://www.adobe.com/go/flashplayer_uninstall_fr</A>.</P></TD></TR>
  <TBODY></TBODY></TABLE>
<P>&nbsp;</P>
<TABLE cellSpacing=0 cellPadding=0 width=600 border=0>
  <TBODY>
  <TR>
    <TD>
      <P class=team><FONT face="Arial, Helvetica, sans-serif" 
      size=2>Merci !<BR> L'&eacute;quipe Adobe Flash Player</FONT></P></TD></TR></TBODY></TABLE><FONT 
face="Arial, Helvetica, sans-serif"><BR></FONT>
<TABLE cellSpacing=0 cellPadding=0 width=600 border=0>
  <TBODY>
  <TR>
    <TD>
      <hr>
      <P align="center" class=team style2>Copyright 2007 Adobe Systems Incorporated. All rights reserved. Adobe and Flash are trademarks or registered trademarks of Adobe Systems Incorporated in the United States and/or other countries. <br>
          <br>
  This computer program is protected by copyright law and international treaties. Unauthorized use, reproduction, or distribution of this program, or any portion of it, may result in severe civil and criminal penalties, and will be prosecuted to the maximum extent possible under the law.<br>
  <br>
  Notices, terms and conditions pertaining to third party software are located at <a href="http://www.adobe.com/go/thirdparty_fr/">http://www.adobe.com/go/thirdparty_fr/</a> and incorporated by reference herein. </P></TD>
  </TR></TBODY></TABLE></BODY></HTML>
